Revit 2027 API
CommandMenuItem.SetAvailabilityClassName Method
 Set availabilityClassName of CommandMenuItem
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAvailabilityClassName(
	string availabilityClassName
)
Public Sub SetAvailabilityClassName (
	availabilityClassName As String
)
public:
void SetAvailabilityClassName(
	String^ availabilityClassName
)
member SetAvailabilityClassName :
        availabilityClassName : string -> unit
Parameters
availabilityClassName String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The availability class name is the class which implements IExternalCommandAvailability interface.
See Also
Reference
CommandMenuItem Class
Autodesk.Revit.UI Namespace